app/controllers/madlibs_controller.rb

SELECT "madlibs".* FROM "madlibs"
---
  def index
    @madlibs = Madlib.all