app/controllers/resumes_controller.rb

SELECT "resumes".* FROM "resumes"
---
  def index
    @resumes = Resume.all

INSERT INTO "resumes" ("created_at", "document", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-05-26 19:31:47.247509"], ["document", "Orel_Resume.pdf"], ["updated_at", "2015-05-26 19:31:47.247509"]]
---
  def create
    @resume = Resume.new(resume_params)

    respond_to do |format|
      if @resume.save

UPDATE "resumes" SET "document" = ?, "updated_at" = ? WHERE "resumes"."id" = 3  [["document", "Orel_Resume.pdf"], ["updated_at", "2015-05-26 19:33:39.507092"]]
---
  def update
    respond_to do |format|
      if @resume.update(resume_params)

DELETE FROM "resumes" WHERE "resumes"."id" = ?  [["id", 2]]
---
  def destroy
    @resume.destroy

SELECT  "resumes".* FROM "resumes"  WHERE "resumes"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_resume
      @resume = Resume.find(params[:id])